ian0318git/m5stack-diag/sdkconfig.defaults
#
# M5Stack CoreS3 — sdkconfig defaults
#
# IDF version: v5.x+
# Target:      ESP32-S3
#

# === Chip target ===
CONFIG_IDF_TARGET="esp32s3"

# === Console (USB Serial/JTAG) ===
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESP_CONSOLE_UART_NONE=n
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y

# === Flash (CoreS3 = 16MB, DIO mode) ===
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Wi-Fi + MQTT push the image past 1MB; use the large single-app
# partition table (factory = 1500KB) instead of the stock 1MB table.
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# === CPU & Cache ===
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_LINE_32B=y
CONFIG_ESP32S3_DATA_CACHE_LINE_32B=y

# === PSRAM — disabled for diagnostics (CoreS3 PSRAM not needed) ===
# CONFIG_SPIRAM=y

# === FreeRTOS ===
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TASK_FUNCTION_WRAPPER=y

# === Logging ===
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_TIMESTAMP_SOURCE_RTOS=y

# === Compiler ===
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# === Watchdog ===
CONFIG_ESP_TASK_WDT_EN=n
CONFIG_ESP_INT_WDT=n

# === Wi-Fi diagnostics ===
# Upload endpoint uses plain http and mqtt by design; TLS (mbedtls)
# would add ~150KB+ and risk overflowing the 1500KB factory partition.
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=n
